zephyrproject-rtos/zephyr/drivers/i2s/i2s_esp32.c
	if (!stream->data->dma_pending) {
		return;
	}

	stream->data->dma_pending = false;

	if (stream->data->mem_block == NULL) {
		LOG_DBG("RX mem_block NULL");
		dev_data->state = I2S_STATE_ERROR;
		goto rx_disable;
	}

#if SOC_GDMA_SUPPORTED
	if (status < 0) {
		dev_data->state = I2S_STATE_ERROR;
		LOG_DBG("RX status bad: %d", status);
		goto rx_disable;
	}
#else
	if (status & I2S_LL_EVENT_RX_DSCR_ERR) {
		k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);
		stream->data->mem_block = NULL;
		stream->data->mem_block_len = 0;
		dev_data->state = I2S_STATE_ERROR;
		LOG_DBG("RX status bad: %d", status);
		goto rx_disable;
	}
#endif /* SOC_GDMA_SUPPORTED */

#if SOC_GDMA_SUPPORTED
	const i2s_hal_context_t *hal = &(dev_cfg->hal);
	uint16_t chunk_len;

	if (stream->data->chunks_rem) {
		uint32_t dst;

		stream->data->chunk_idx++;
		stream->data->chunks_rem--;
		if (stream->data->chunks_rem) {
			chunk_len = I2S_ESP32_DMA_BUFFER_MAX_SIZE;
		} else {
			chunk_len = stream->data->mem_block_len % I2S_ESP32_DMA_BUFFER_MAX_SIZE;
			if (chunk_len == 0) {
				chunk_len = I2S_ESP32_DMA_BUFFER_MAX_SIZE;
			}
		}

		dst = (uint32_t)stream->data->mem_block + (stream->data->chunk_idx *
							   I2S_ESP32_DMA_BUFFER_MAX_SIZE);
		err = dma_reload(stream->conf->dma_dev, stream->conf->dma_channel, (uint32_t)NULL,
				(uint32_t)dst, chunk_len);
		if (err < 0) {
			LOG_DBG("Failed to reload DMA channel: %" PRIu32,
				stream->conf->dma_channel);
			dev_data->state = I2S_STATE_ERROR;
			goto rx_disable;
		}

		i2s_ll_rx_set_eof_num(hal->dev, chunk_len);

		err = dma_start(stream->conf->dma_dev, stream->conf->dma_channel);
		if (err < 0) {
			LOG_DBG("Failed to start DMA channel: %" PRIu32, stream->conf->dma_channel);
			dev_data->state = I2S_STATE_ERROR;
			goto rx_disable;
		}

		stream->data->dma_pending = true;

		return;
	}
#endif /* SOC_GDMA_SUPPORTED */

	struct queue_item item = {
		.buffer = stream->data->mem_block,
		.size = stream->data->mem_block_len
	};

	err = k_msgq_put(&stream->data->queue, &item, K_NO_WAIT);
	if (err < 0) {
		LOG_DBG("RX queue full");
		dev_data->state = I2S_STATE_ERROR;
		goto rx_disable;
	}

	/* Queue owns the block. */
	stream->data->mem_block = NULL;
	stream->data->mem_block_len = 0;

	if (dev_data->state == I2S_STATE_STOPPING) {
		if (dev_data->active_dir == I2S_DIR_RX ||
		    (dev_data->active_dir == I2S_DIR_BOTH && !dev_cfg->tx.data->transferring)) {
			dev_data->state = I2S_STATE_READY;
			goto rx_disable;
		}
	}

	err = k_mem_slab_alloc(stream->data->i2s_cfg.mem_slab, &stream->data->mem_block, K_NO_WAIT);
	if (err < 0) {
		LOG_DBG("RX failed to allocate memory from slab: %i:", err);
		dev_data->state = I2S_STATE_ERROR;
		goto rx_disable;
	}
	stream->data->mem_block_len = stream->data->i2s_cfg.block_size;

	err = i2s_esp32_restart_dma(dev, I2S_DIR_RX);
	if (err < 0) {
		LOG_DBG("Failed to restart RX transfer: %d", err);
		k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);
		stream->data->mem_block = NULL;
		stream->data->mem_block_len = 0;
		dev_data->state = I2S_STATE_ERROR;
		goto rx_disable;
	}

	return;

rx_disable:
	i2s_esp32_rx_stop_transfer(dev);
}

#if !SOC_GDMA_SUPPORTED

static void IRAM_ATTR i2s_esp32_rx_handler(void *arg)
{
	if (arg == NULL) {
		return;
	}

	struct device *dev = (struct device *)arg;
	const struct i2s_esp32_cfg *const dev_cfg = dev->config;
	const i2s_hal_context_t *hal = &(dev_cfg->hal);
	uint32_t status =
		i2s_hal_get_intr_status(hal) & (I2S_LL_RX_EVENT_MASK | I2S_LL_EVENT_RX_DSCR_ERR);

	if (status == 0) {
		return;
	}

	i2s_hal_clear_intr_status(hal, status);
	if (status & I2S_LL_EVENT_RX_EOF) {
		i2s_esp32_rx_callback((void *)arg, status);
	}
}

#endif /* !SOC_GDMA_SUPPORTED */

static int i2s_esp32_rx_start_transfer(const struct device *dev)
{
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->rx;
	const i2s_hal_context_t *hal = &dev_cfg->hal;
	int err;

	err = k_mem_slab_alloc(stream->data->i2s_cfg.mem_slab, &stream->data->mem_block, K_NO_WAIT);
	if (err < 0) {
		return -ENOMEM;
	}
	stream->data->mem_block_len = stream->data->i2s_cfg.block_size;

	i2s_hal_rx_stop(hal);
	i2s_hal_rx_reset(hal);
#if !SOC_GDMA_SUPPORTED
	i2s_hal_rx_reset_dma(hal);
#endif /* !SOC_GDMA_SUPPORTED */
	i2s_hal_rx_reset_fifo(hal);

	err = i2s_esp32_start_dma(dev, I2S_DIR_RX);
	if (err < 0) {
		LOG_DBG("Failed to start RX DMA transfer: %d", err);
		k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);
		stream->data->mem_block = NULL;
		stream->data->mem_block_len = 0;
		return -EIO;
	}

	i2s_hal_rx_start(hal);

#if !SOC_GDMA_SUPPORTED
	esp_intr_enable(stream->data->irq_handle);
#endif /* !SOC_GDMA_SUPPORTED */

	stream->data->transferring = true;

	return 0;
}

static void IRAM_ATTR i2s_esp32_rx_stop_transfer(const struct device *dev)
{
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->rx;
	const i2s_hal_context_t *hal = &(dev_cfg->hal);
	int err;

#if SOC_GDMA_SUPPORTED
	/* Stop the I2S unit before the DMA, so nothing keeps filling the FIFO. */
	i2s_hal_rx_stop(hal);
	err = dma_stop(stream->conf->dma_dev, stream->conf->dma_channel);
#else
	err = 0;
	esp_intr_disable(stream->data->irq_handle);
	i2s_hal_rx_stop_link(hal);
	i2s_hal_rx_disable_intr(hal);
	i2s_hal_clear_intr_status(hal, I2S_LL_RX_EVENT_MASK | I2S_LL_EVENT_RX_DSCR_ERR);
#endif /* SOC_GDMA_SUPPORTED */

	/* Cleared before the status test: a failed stop must not strand STOPPING. */
	stream->data->dma_pending = false;
	stream->data->transferring = false;

	if (err < 0) {
		/* The channel may still be running, so the block is not ours to release. */
		return;
	}

#if SOC_GDMA_SUPPORTED
	if (stream->data->mem_block != NULL) {
		k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);
		stream->data->mem_block = NULL;
	}
#else
	/* Legacy DMA may still own the block; do not return it to the slab. */
	stream->data->mem_block = NULL;
#endif /* SOC_GDMA_SUPPORTED */
	stream->data->mem_block_len = 0;

	i2s_esp32_stop_if_idle(dev);
}

#endif /* I2S_ESP32_IS_DIR_EN(rx) */

#if I2S_ESP32_IS_DIR_EN(tx)

