zephyrproject-rtos/zephyr/drivers/i2s/i2s_esp32.c
static void i2s_esp32_tx_stop_transfer(const struct device *dev);

void IRAM_ATTR i2s_esp32_tx_compl_transfer(struct k_timer *timer)
{
	struct i2s_esp32_data *dev_data =
		CONTAINER_OF(timer, struct i2s_esp32_data, tx_deferred_transfer_timer);
	const struct device *dev = dev_data->dev;
	const struct i2s_esp32_cfg *const dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->tx;
	struct queue_item item;
	int err;

	if (dev_data->state == I2S_STATE_ERROR) {
		goto tx_disable;
	}

	if (dev_data->state == I2S_STATE_STOPPING) {
		if (k_msgq_num_used_get(&stream->data->queue) == 0 ||
		    dev_data->tx_stop_without_draining == true) {
			if (dev_data->active_dir == I2S_DIR_TX ||
			    (dev_data->active_dir == I2S_DIR_BOTH &&
			     !dev_cfg->rx.data->transferring)) {
				dev_data->state = I2S_STATE_READY;
			}
			goto tx_disable;
		}
	}

	err = k_msgq_get(&stream->data->queue, &item, K_NO_WAIT);
	if (err < 0) {
		dev_data->state = I2S_STATE_ERROR;
		LOG_DBG("TX queue empty: %d", err);
		goto tx_disable;
	}

	stream->data->mem_block = item.buffer;
	stream->data->mem_block_len = item.size;

	err = i2s_esp32_restart_dma(dev, I2S_DIR_TX);
	if (err < 0) {
		dev_data->state = I2S_STATE_ERROR;
		LOG_DBG("Failed to restart TX transfer: %d", err);
		stream->data->dma_pending = false;
		if (stream->data->mem_block != NULL) {
			k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);
		}
		stream->data->mem_block = NULL;
		stream->data->mem_block_len = 0;
		goto tx_disable;
	}

	return;

tx_disable:
	i2s_esp32_tx_stop_transfer(dev);
}

#if SOC_GDMA_SUPPORTED
static void IRAM_ATTR i2s_esp32_tx_callback(const struct device *dma_dev, void *arg,
					    uint32_t channel, int status)
#else
static void IRAM_ATTR i2s_esp32_tx_callback(void *arg, int status)
#endif /* SOC_GDMA_SUPPORTED */
{
	const struct device *dev = (const struct device *)arg;
	struct i2s_esp32_data *dev_data = dev->data;
	const struct i2s_esp32_cfg *const dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->tx;

	if (dev_data->state == I2S_STATE_ERROR) {
		goto tx_disable;
	}

	if (!stream->data->dma_pending) {
		return;
	}

	stream->data->dma_pending = false;

	if (stream->data->mem_block == NULL) {
		LOG_DBG("TX mem_block NULL");
		dev_data->state = I2S_STATE_ERROR;
		goto tx_disable;
	}

#if SOC_GDMA_SUPPORTED
	if (status < 0) {
		dev_data->state = I2S_STATE_ERROR;
		LOG_DBG("TX bad status: %d", status);
		goto tx_disable;
	}
#endif /* SOC_GDMA_SUPPORTED */

	k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);
	stream->data->mem_block = NULL;
	stream->data->mem_block_len = 0;

#if !SOC_GDMA_SUPPORTED
	if (status & I2S_LL_EVENT_TX_DSCR_ERR) {
		dev_data->state = I2S_STATE_ERROR;
		LOG_DBG("TX bad status: %d", status);
		goto tx_disable;
	}
#endif /* !SOC_GDMA_SUPPORTED */

#if CONFIG_I2S_ESP32_ALLOWED_EMPTY_TX_QUEUE_DEFERRAL_TIME_MS
	if (k_msgq_num_used_get(&stream->data->queue) == 0 &&
	    dev_data->state != I2S_STATE_STOPPING) {
		k_timer_start(&dev_data->tx_deferred_transfer_timer,
			      K_MSEC(CONFIG_I2S_ESP32_ALLOWED_EMPTY_TX_QUEUE_DEFERRAL_TIME_MS),
			      K_NO_WAIT);
	} else {
#else
	{
#endif
		i2s_esp32_tx_compl_transfer(&dev_data->tx_deferred_transfer_timer);
	}

	return;

tx_disable:
	i2s_esp32_tx_stop_transfer(dev);
}

#if !SOC_GDMA_SUPPORTED

static void IRAM_ATTR i2s_esp32_tx_handler(void *arg)
{
	if (arg == NULL) {
		return;
	}

	struct device *dev = (struct device *)arg;
	const struct i2s_esp32_cfg *const dev_cfg = dev->config;
	const i2s_hal_context_t *hal = &(dev_cfg->hal);
	uint32_t status =
		i2s_hal_get_intr_status(hal) & (I2S_LL_TX_EVENT_MASK | I2S_LL_EVENT_TX_DSCR_ERR);

	if (status == 0) {
		return;
	}

	i2s_hal_clear_intr_status(hal, status);
	if (status & I2S_LL_EVENT_TX_EOF) {
		i2s_esp32_tx_callback((void *)arg, status);
	}
}

#endif /* !SOC_GDMA_SUPPORTED */

static int i2s_esp32_tx_start_transfer(const struct device *dev)
{
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->tx;
	const i2s_hal_context_t *hal = &dev_cfg->hal;
	struct queue_item item;
	int err;

	err = k_msgq_get(&stream->data->queue, &item, K_NO_WAIT);
	if (err < 0) {
		return -ENOMEM;
	}

	stream->data->mem_block = item.buffer;
	stream->data->mem_block_len = item.size;

	i2s_hal_tx_stop(hal);
	i2s_hal_tx_reset(hal);
#if !SOC_GDMA_SUPPORTED
	i2s_hal_tx_reset_dma(hal);
#endif /* !SOC_GDMA_SUPPORTED */
	i2s_hal_tx_reset_fifo(hal);

	err = i2s_esp32_start_dma(dev, I2S_DIR_TX);
	if (err < 0) {
		LOG_DBG("Failed to start TX DMA transfer: %d", err);
		stream->data->dma_pending = false;
		if (stream->data->mem_block != NULL) {
			k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);
		}
		stream->data->mem_block = NULL;
		stream->data->mem_block_len = 0;
		return -EIO;
	}

	i2s_hal_tx_start(hal);

#if !SOC_GDMA_SUPPORTED
	esp_intr_enable(stream->data->irq_handle);
#endif /* !SOC_GDMA_SUPPORTED */

	stream->data->transferring = true;

	return 0;
}

static void IRAM_ATTR i2s_esp32_tx_stop_transfer(const struct device *dev)
{
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->tx;
	struct i2s_esp32_data *dev_data = dev->data;
	int err;

	k_timer_stop(&dev_data->tx_deferred_transfer_timer);

#if SOC_GDMA_SUPPORTED
	err = dma_stop(stream->conf->dma_dev, stream->conf->dma_channel);
#else
	const i2s_hal_context_t *hal = &(dev_cfg->hal);

	err = 0;
	esp_intr_disable(stream->data->irq_handle);
	i2s_hal_tx_stop_link(hal);
	i2s_hal_tx_disable_intr(hal);
	i2s_hal_clear_intr_status(hal, I2S_LL_TX_EVENT_MASK | I2S_LL_EVENT_TX_DSCR_ERR);
#endif /* SOC_GDMA_SUPPORTED */

	/* Cleared before the status test: a failed stop must not strand STOPPING. */
	stream->data->dma_pending = false;
	stream->data->transferring = false;

	if (err < 0) {
		/* The channel may still be running, so the block is not ours to release. */
		return;
	}

#if SOC_GDMA_SUPPORTED
	if (stream->data->mem_block != NULL) {
		k_mem_slab_free(stream->data->i2s_cfg.mem_slab, stream->data->mem_block);
		stream->data->mem_block = NULL;
	}
#else
	/* Legacy DMA may still own the block; do not return it to the slab. */
	stream->data->mem_block = NULL;
#endif /* SOC_GDMA_SUPPORTED */
	stream->data->mem_block_len = 0;

	i2s_esp32_stop_if_idle(dev);
}

#endif /* I2S_ESP32_IS_DIR_EN(tx) */

static int i2s_esp32_start_transfer(const struct device *dev, enum i2s_dir dir)
{
	int err = 0;

#if I2S_ESP32_IS_DIR_EN(rx)
	if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
		err = i2s_esp32_rx_start_transfer(dev);
		if (err < 0) {
			LOG_DBG("RX failed to start transfer");
			goto start_transfer_end;
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(rx) */

#if I2S_ESP32_IS_DIR_EN(tx)
	if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
		err = i2s_esp32_tx_start_transfer(dev);
		if (err < 0) {
			LOG_DBG("TX failed to start transfer");
			goto start_transfer_end;
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(tx) */

start_transfer_end:
#if I2S_ESP32_IS_DIR_EN(rx) && I2S_ESP32_IS_DIR_EN(tx)
	if (dir == I2S_DIR_BOTH && err < 0) {
		const struct i2s_esp32_cfg *dev_cfg = dev->config;

		if (dev_cfg->rx.data->transferring && !dev_cfg->tx.data->transferring) {
			i2s_esp32_rx_stop_transfer(dev);
		}

		if (!dev_cfg->rx.data->transferring && dev_cfg->tx.data->transferring) {
			i2s_esp32_tx_stop_transfer(dev);
		}
	}
#endif /* I2S_ESP32_IS_DIR_EN(rx) && I2S_ESP32_IS_DIR_EN(tx) */

