zephyrproject-rtos/zephyr/drivers/i2s/i2s_esp32.c
	data_format = i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK;

	if (data_format != I2S_FMT_DATA_FORMAT_I2S &&
	    data_format != I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED &&
	    data_format != I2S_FMT_DATA_FORMAT_RIGHT_JUSTIFIED) {
		LOG_DBG("Invalid data format: %u", (unsigned int)data_format);
		return -EINVAL;
	}

	if (data_format == I2S_FMT_DATA_FORMAT_I2S && i2s_cfg->format & I2S_FMT_DATA_ORDER_LSB) {
		LOG_DBG("Invalid format: %u", (unsigned int)i2s_cfg->format);
		return -EINVAL;
	}

	if (i2s_cfg->word_size != 8 && i2s_cfg->word_size != 16 && i2s_cfg->word_size != 24 &&
	    i2s_cfg->word_size != 32) {
		LOG_DBG("Word size not supported: %d", (int)i2s_cfg->word_size);
		return -EINVAL;
	}

	if (i2s_cfg->channels != 2) {
		LOG_DBG("Currently only 2 channels are supported");
		return -EINVAL;
	}

	if (i2s_cfg->options & I2S_OPT_LOOPBACK) {
		LOG_DBG("Unsupported option: I2S_OPT_LOOPBACK");
		LOG_DBG("To enable loopback, use the same SD for TX and RX pinctrl");
		return -EINVAL;
	}

	if (i2s_cfg->options & I2S_OPT_PINGPONG) {
		LOG_DBG("Unsupported option: I2S_OPT_PINGPONG");
		return -EINVAL;
	}

	return 0;
}

static int i2s_esp32_configure(const struct device *dev, enum i2s_dir dir,
			       const struct i2s_config *i2s_cfg)
{
	struct i2s_esp32_data *dev_data = dev->data;
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream;
	i2s_hal_slot_config_t slot_cfg = {0};
	uint8_t data_format;
	bool is_target;
	int err;

	err = i2s_esp32_config_check(dev, dir, i2s_cfg);
	if (err < 0) {
		return err;
	}

	if (i2s_cfg->frame_clk_freq == 0U) {
		i2s_esp32_queue_drop(dev, dir);

#if I2S_ESP32_IS_DIR_EN(rx)
		if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
			stream = &dev_cfg->rx;
			memset(&stream->data->i2s_cfg, 0, sizeof(struct i2s_config));
			stream->data->configured = false;
		}
#endif /* I2S_ESP32_IS_DIR_EN(rx) */

#if I2S_ESP32_IS_DIR_EN(tx)
		if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
			stream = &dev_cfg->tx;
			memset(&stream->data->i2s_cfg, 0, sizeof(struct i2s_config));
			stream->data->configured = false;
		}
#endif /* I2S_ESP32_IS_DIR_EN(tx) */

		dev_data->state = I2S_STATE_NOT_READY;

		return 0;
	}

	if ((i2s_cfg->options & I2S_OPT_FRAME_CLK_TARGET) != 0 &&
	    (i2s_cfg->options & I2S_OPT_BIT_CLK_TARGET) != 0) {
		is_target = true;
	} else if ((i2s_cfg->options & I2S_OPT_FRAME_CLK_TARGET) == 0 &&
		   (i2s_cfg->options & I2S_OPT_BIT_CLK_TARGET) == 0) {
		is_target = false;
	} else {
		LOG_DBG("I2S_OPT_FRAME_CLK and I2S_OPT_BIT_CLK options are incompatible");
		return -EINVAL;
	}

	data_format = i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK;

	slot_cfg.data_bit_width = i2s_cfg->word_size;
	slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
	slot_cfg.slot_bit_width = i2s_cfg->word_size > 16 ? 32 : 16;
	if (data_format == I2S_FMT_DATA_FORMAT_I2S) {
		slot_cfg.std.ws_pol = i2s_cfg->format & I2S_FMT_FRAME_CLK_INV ? true : false;
		slot_cfg.std.bit_shift = true;
#if SOC_I2S_HW_VERSION_2
		slot_cfg.std.left_align = true;
#endif /* SOC_I2S_HW_VERSION_2 */
	} else if (data_format == I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED) {
		slot_cfg.std.ws_pol = i2s_cfg->format & I2S_FMT_FRAME_CLK_INV ? false : true;
		slot_cfg.std.bit_shift = false;
#if SOC_I2S_HW_VERSION_2
		slot_cfg.std.left_align = true;
	} else if (data_format == I2S_FMT_DATA_FORMAT_RIGHT_JUSTIFIED) {
		slot_cfg.std.ws_pol = i2s_cfg->format & I2S_FMT_FRAME_CLK_INV ? false : true;
		slot_cfg.std.bit_shift = false;
		slot_cfg.std.left_align = false;
#endif /* SOC_I2S_HW_VERSION_2 */
	} else {
		LOG_DBG("Unsupported data format: %u", (unsigned int)data_format);
		return -EINVAL;
	}

	slot_cfg.std.ws_width = slot_cfg.slot_bit_width;
	slot_cfg.std.slot_mask = I2S_STD_SLOT_BOTH;
#if SOC_I2S_HW_VERSION_1
	slot_cfg.std.msb_right = true;
#elif SOC_I2S_HW_VERSION_2
	slot_cfg.std.big_endian = false;
	slot_cfg.std.bit_order_lsb = i2s_cfg->format & I2S_FMT_DATA_ORDER_LSB ? true : false;
#endif /* SOC_I2S_HW_VERSION_1 */

	i2s_hal_clock_info_t i2s_hal_clock_info;
	i2s_hal_context_t *hal = (i2s_hal_context_t *)&(dev_cfg->hal);

	err = i2s_esp32_calculate_clock(i2s_cfg, slot_cfg.slot_bit_width, &i2s_hal_clock_info);
	if (err != ESP_OK) {
		return -EINVAL;
	}

#if I2S_ESP32_IS_DIR_EN(rx)
	if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
		bool rx_is_target;

		rx_is_target = is_target;
		if (dir == I2S_DIR_BOTH || (dev_cfg->tx.data && dev_cfg->tx.data->configured)) {
			rx_is_target = true;
		}

		i2s_hal_std_set_rx_slot(hal, rx_is_target, &slot_cfg);
		i2s_hal_set_rx_clock(hal, &i2s_hal_clock_info, I2S_ESP32_CLK_SRC, NULL);
		i2s_ll_rx_enable_std(hal->dev);

		stream = &dev_cfg->rx;
		memcpy(&stream->data->i2s_cfg, i2s_cfg, sizeof(struct i2s_config));
		stream->data->configured = true;
	}
#endif /* I2S_ESP32_IS_DIR_EN(rx) */

#if I2S_ESP32_IS_DIR_EN(tx)
	if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
		i2s_hal_std_set_tx_slot(hal, is_target, &slot_cfg);
		i2s_hal_set_tx_clock(hal, &i2s_hal_clock_info, I2S_ESP32_CLK_SRC, NULL);
		i2s_ll_tx_enable_std(hal->dev);

		stream = &dev_cfg->tx;
		memcpy(&stream->data->i2s_cfg, i2s_cfg, sizeof(struct i2s_config));
		stream->data->configured = true;
	}
#endif /* I2S_ESP32_IS_DIR_EN(tx) */

	if (dev_cfg->rx.data && dev_cfg->rx.data->configured && dev_cfg->tx.data &&
	    dev_cfg->tx.data->configured) {
		i2s_ll_share_bck_ws(hal->dev, true);
	} else {
		i2s_ll_share_bck_ws(hal->dev, false);
	}

	dev_data->state = I2S_STATE_READY;

	return 0;
}

static const struct i2s_config *i2s_esp32_config_get(const struct device *dev, enum i2s_dir dir)
{
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream;

	if (dir == I2S_DIR_RX) {
#if I2S_ESP32_IS_DIR_EN(rx)
		stream = &dev_cfg->rx;
		if (!stream->data) {
			LOG_DBG("RX not enabled");
			return NULL;
		}
#else
		LOG_DBG("RX not enabled");
		return NULL;
#endif /* I2S_ESP32_IS_DIR_EN(rx) */
	} else if (dir == I2S_DIR_TX) {
#if I2S_ESP32_IS_DIR_EN(tx)
		stream = &dev_cfg->tx;
		if (!stream->data) {
			LOG_DBG("TX not enabled");
			return NULL;
		}
#else
		LOG_DBG("TX not enabled");
		return NULL;
#endif /* I2S_ESP32_IS_DIR_EN(tx) */
	} else {
		LOG_DBG("Invalid direction: %d", (int)dir);
		return NULL;
	}

	if (!stream->data->configured) {
		return NULL;
	}

	return &stream->data->i2s_cfg;
}

static int i2s_esp32_trigger_check(const struct device *dev, enum i2s_dir dir,
				   enum i2s_trigger_cmd cmd)
{
	struct i2s_esp32_data *dev_data = dev->data;
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	bool configured, cmd_allowed;
	enum i2s_state state;

	if (dir == I2S_DIR_BOTH) {
		if (dev_cfg->rx.conf && dev_cfg->rx.data && dev_cfg->tx.conf && dev_cfg->tx.data) {
			configured = dev_cfg->rx.data->configured && dev_cfg->tx.data->configured;
		} else {
			LOG_DBG("I2S_DIR_BOTH not supported");
			return -ENOSYS;
		}
	} else if (dir == I2S_DIR_RX) {
		if (!dev_cfg->rx.conf || !dev_cfg->rx.data) {
			LOG_DBG("I2S_DIR_RX not supported");
			return -ENOSYS;
		}
		configured = dev_cfg->rx.data->configured;
	} else if (dir == I2S_DIR_TX) {
		if (!dev_cfg->tx.conf || !dev_cfg->tx.data) {
			LOG_DBG("I2S_DIR_TX not supported");
			return -ENOSYS;
		}
		configured = dev_cfg->tx.data->configured;
	} else {
		LOG_DBG("Invalid dir: %d", dir);
		return -EINVAL;
	}

	if (!configured) {
		LOG_DBG("Device is not configured");
		return -EIO;
	}

	state = dev_data->state;
	switch (cmd) {
	case I2S_TRIGGER_START:
		cmd_allowed = (state == I2S_STATE_READY);
		break;
	case I2S_TRIGGER_STOP:
		__fallthrough;
	case I2S_TRIGGER_DRAIN:
		cmd_allowed = (state == I2S_STATE_RUNNING);
		break;
	case I2S_TRIGGER_DROP:
		cmd_allowed = (state != I2S_STATE_NOT_READY) && configured;
		break;
	case I2S_TRIGGER_PREPARE:
		cmd_allowed = (state == I2S_STATE_ERROR);
		break;
	default:
		LOG_DBG("Invalid trigger: %d", cmd);
		return -EINVAL;
	}

	if (!cmd_allowed) {
		switch (cmd) {
		case I2S_TRIGGER_START:
			LOG_DBG("START - Invalid state: %d", (int)state);
			break;
		case I2S_TRIGGER_STOP:
			LOG_DBG("STOP - Invalid state: %d", (int)state);
			break;
		case I2S_TRIGGER_DRAIN:
			LOG_DBG("DRAIN - Invalid state: %d", (int)state);
			break;
		case I2S_TRIGGER_DROP:
			LOG_DBG("DROP - invalid state: %d", (int)state);
			break;
		case I2S_TRIGGER_PREPARE:
			LOG_DBG("PREPARE - invalid state: %d", (int)state);
			break;
		default:
			LOG_DBG("Invalid trigger: %d", cmd);
		}

		return -EIO;
	}

