zephyrproject-rtos/zephyr/drivers/i2s/i2s_esp32.c
	return 0;
}

static int i2s_esp32_trigger(const struct device *dev, enum i2s_dir dir, enum i2s_trigger_cmd cmd)
{
	struct i2s_esp32_data *dev_data = dev->data;
	bool at_least_one_dir_with_pending_transfer;
	unsigned int key;
	int err;

	err = i2s_esp32_trigger_check(dev, dir, cmd);
	if (err < 0) {
		return err;
	}

	switch (cmd) {
	case I2S_TRIGGER_START:
		dev_data->active_dir = dir;
		dev_data->tx_stop_without_draining = true;
		err = i2s_esp32_start_transfer(dev, dir);
		if (err < 0) {
			LOG_DBG("START - Transfer start failed: %d", err);
			return -EIO;
		}
		dev_data->state = I2S_STATE_RUNNING;
		break;
	case I2S_TRIGGER_STOP:
		__fallthrough;
	case I2S_TRIGGER_DRAIN:
		if (dev_data->active_dir != dir) {
			LOG_DBG("Trigger dir (%d) different from active dir (%d)", dir,
				dev_data->active_dir);
			return -EINVAL;
		}

		key = irq_lock();
		at_least_one_dir_with_pending_transfer = i2s_esp32_try_stop_transfer(dev, dir, cmd);
		if (at_least_one_dir_with_pending_transfer) {
#if I2S_ESP32_IS_DIR_EN(tx)
			if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
				switch (cmd) {
				case I2S_TRIGGER_STOP:
					dev_data->tx_stop_without_draining = true;
					break;
				case I2S_TRIGGER_DRAIN:
					dev_data->tx_stop_without_draining = false;
				default:
				}
			}
#endif /* I2S_ESP32_IS_DIR_EN(tx) */
			dev_data->state = I2S_STATE_STOPPING;
		} else {
			dev_data->state = I2S_STATE_READY;
		}
		irq_unlock(key);
		break;
	case I2S_TRIGGER_DROP:
		if (dev_data->state == I2S_STATE_RUNNING && dev_data->active_dir != dir) {
			LOG_DBG("Trigger dir (%d) different from active dir (%d)", dir,
				dev_data->active_dir);
			return -EINVAL;
		}

		key = irq_lock();
		i2s_esp32_stop_transfer(dev, dir);
		i2s_esp32_queue_drop(dev, dir);
		dev_data->state = I2S_STATE_READY;
		irq_unlock(key);
		break;
	case I2S_TRIGGER_PREPARE:
		i2s_esp32_queue_drop(dev, dir);
		dev_data->state = I2S_STATE_READY;
		break;
	default:
		LOG_DBG("Unsupported trigger command: %d", (int)cmd);
		return -EIO;
	}

	return 0;
}

static int i2s_esp32_read(const struct device *dev, void **mem_block, size_t *size)
{
#if I2S_ESP32_IS_DIR_EN(rx)
	struct i2s_esp32_data *dev_data = dev->data;
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->rx;
	enum i2s_state state = dev_data->state;
	struct queue_item item;
	int err;

	if (!stream->data || !stream->conf) {
		LOG_DBG("RX not enabled");
		return -EIO;
	}

	if (!stream->data->configured) {
		LOG_DBG("RX not configured");
		return -EIO;
	}

	if (state == I2S_STATE_NOT_READY) {
		LOG_DBG("Invalid state: %d", (int)state);
		return -EIO;
	}

	err = k_msgq_get(&stream->data->queue, &item,
			 (state == I2S_STATE_ERROR) ? K_NO_WAIT
						    : K_MSEC(stream->data->i2s_cfg.timeout));
	if (err == 0) {
		*mem_block = item.buffer;
		*size = item.size;
	} else {
		LOG_DBG("RX queue empty");

		if (err == -ENOMSG) {
			err = -EIO;
		}
	}

	return err;
#else
	LOG_DBG("RX not enabled");
	return -EIO;
#endif /* I2S_ESP32_IS_DIR_EN(rx) */
}

static int i2s_esp32_write(const struct device *dev, void *mem_block, size_t size)
{
#if I2S_ESP32_IS_DIR_EN(tx)
	struct i2s_esp32_data *dev_data = dev->data;
	const struct i2s_esp32_cfg *dev_cfg = dev->config;
	const struct i2s_esp32_stream *stream = &dev_cfg->tx;
	enum i2s_state state = dev_data->state;
	int err;

	if (!stream->data || !stream->conf) {
		LOG_DBG("TX not enabled");
		return -EIO;
	}

	if (!stream->data->configured) {
		LOG_DBG("TX not configured");
		return -EIO;
	}

	if (state != I2S_STATE_RUNNING && state != I2S_STATE_READY) {
		LOG_DBG("Invalid state: %d", (int)state);
		return -EIO;
	}

	if (size > stream->data->i2s_cfg.block_size) {
		LOG_DBG("Max write size is: %u", stream->data->i2s_cfg.block_size);
		return -EIO;
	}

	struct queue_item item = {.buffer = mem_block, .size = size};

	err = k_msgq_put(&stream->data->queue, &item,
			 K_MSEC(stream->data->i2s_cfg.timeout));
	if (err < 0) {
		LOG_DBG("TX queue full");
	}

	return err;
#else
	LOG_DBG("TX not enabled");
	return -EIO;
#endif /* I2S_ESP32_IS_DIR_EN(tx) */
}

static DEVICE_API(i2s, i2s_esp32_driver_api) = {
	.configure = i2s_esp32_configure,
	.config_get = i2s_esp32_config_get,
	.trigger = i2s_esp32_trigger,
	.read = i2s_esp32_read,
	.write = i2s_esp32_write
};

#if SOC_GDMA_SUPPORTED

#define I2S_ESP32_DT_INST_SANITY_CHECK(index)                                                      \
	BUILD_ASSERT(DT_INST_NODE_HAS_PROP(index, dmas), "Missing property: dmas");                \
	BUILD_ASSERT(DT_INST_NODE_HAS_PROP(index, dma_names), "Missing property: dma-names");

#define I2S_ESP32_STREAM_DECL_DESC(index, rx)

#define I2S_ESP32_STREAM_DECLARE_DATA(index, dir)

#define I2S_ESP32_STREAM_DECLARE_CONF(index, dir)                                                  \
	.dma_dev = UTIL_AND(DT_INST_DMAS_HAS_NAME(index, dir),                                     \
			    DEVICE_DT_GET(DT_INST_DMAS_CTLR_BY_NAME(index, dir))),                 \
	.dma_channel = UTIL_AND(DT_INST_DMAS_HAS_NAME(index, dir),                                 \
				DT_INST_DMAS_CELL_BY_NAME(index, dir, channel))

#else

#define I2S_ESP32_DT_INST_SANITY_CHECK(index)                                                      \
	BUILD_ASSERT(!DT_INST_NODE_HAS_PROP(index, dmas), "Unexpected property: dmas");            \
	BUILD_ASSERT(!DT_INST_NODE_HAS_PROP(index, dma_names), "Unexpected property: dma-names");  \
	BUILD_ASSERT(DT_INST_NODE_HAS_PROP(index, interrupt_names),                                \
		     "Missing property: interrupt-names")

#define I2S_ESP32_STREAM_DECL_DESC(index, dir)                                                     \
	lldesc_t i2s_esp32_stream_##index##_##dir##_dma_desc[CONFIG_I2S_ESP32_DMA_DESC_NUM_MAX]

#define I2S_ESP32_STREAM_DECLARE_DATA(index, dir) .irq_handle = NULL

#define I2S_ESP32_STREAM_DECLARE_CONF(index, dir)                                                  \
	.irq_source = COND_CODE_1(DT_INST_IRQ_HAS_NAME(index, dir),                                \
				  (DT_INST_IRQ_BY_NAME(index, dir, irq)), (-1)),                   \
	.irq_priority = COND_CODE_1(DT_INST_IRQ_HAS_NAME(index, dir),                              \
				    (DT_INST_IRQ_BY_NAME(index, dir, priority)), (-1)),            \
	.irq_flags = COND_CODE_1(DT_INST_IRQ_HAS_NAME(index, dir),                                 \
				 (DT_INST_IRQ_BY_NAME(index, dir, flags)), (-1)),                  \
	.dma_desc = UTIL_AND(DT_INST_IRQ_HAS_NAME(index, dir),                                     \
			     i2s_esp32_stream_##index##_##dir##_dma_desc)

