zephyrproject-rtos/zephyr/drivers/i2s/i2s_esp32.c
#endif /* SOC_GDMA_SUPPORTED */

#define I2S_ESP32_STREAM_DECLARE(index, dir)                                                       \
	struct i2s_esp32_stream_data i2s_esp32_stream_##index##_##dir##_data = {                   \
		.configured = false,                                                               \
		.transferring = false,                                                             \
		.i2s_cfg = {0},                                                                    \
		.mem_block = NULL,                                                                 \
		.mem_block_len = 0,                                                                \
		.queue = {},                                                                       \
		.dma_pending = false,                                                              \
		I2S_ESP32_STREAM_DECLARE_DATA(index, dir)};                                        \
                                                                                                   \
	const struct i2s_esp32_stream_conf i2s_esp32_stream_##index##_##dir##_conf = {             \
		I2S_ESP32_STREAM_DECLARE_CONF(index, dir)};

#define I2S_ESP32_STREAM_COND_DECLARE(index, dir)                                                  \
	COND_CODE_1(DT_INST_IRQ_HAS_NAME(index, dir), (I2S_ESP32_STREAM_DECL_DESC(index, dir)),    \
		    ());   \
	COND_CODE_1(UTIL_OR(DT_INST_DMAS_HAS_NAME(index, dir), DT_INST_IRQ_HAS_NAME(index, dir)),  \
		    (I2S_ESP32_STREAM_DECLARE(index, dir)), ())

#define I2S_ESP32_STREAM_INIT(index, dir)                                                          \
	COND_CODE_1(UTIL_OR(DT_INST_DMAS_HAS_NAME(index, dir), DT_INST_IRQ_HAS_NAME(index, dir)),  \
		    (.dir = {.conf = &i2s_esp32_stream_##index##_##dir##_conf,                     \
			     .data = &i2s_esp32_stream_##index##_##dir##_data}),                   \
		    (.dir = {.conf = NULL, .data = NULL}))

#define I2S_ESP32_INIT(index)                                                                      \
	I2S_ESP32_DT_INST_SANITY_CHECK(index);                                                     \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
                                                                                                   \
	I2S_ESP32_STREAM_COND_DECLARE(index, rx);                                                  \
	I2S_ESP32_STREAM_COND_DECLARE(index, tx);                                                  \
                                                                                                   \
	static struct i2s_esp32_data i2s_esp32_data_##index = {                                    \
		.state = I2S_STATE_NOT_READY,                                                      \
		.tx_stop_without_draining = true,                                                  \
		.clk_info = {0},                                                                   \
	};                                                                                         \
                                                                                                   \
	static const struct i2s_esp32_cfg i2s_esp32_config_##index = {                             \
		.unit = DT_PROP(DT_DRV_INST(index), unit),                                         \
		.hal = {.dev = (i2s_dev_t *)DT_INST_REG_ADDR(index)},                              \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                     \
		.clock_dev = DEVICE_DT_GET(DT_INST_CLOCKS_CTLR(index)),                            \
		.clock_subsys = (clock_control_subsys_t)DT_INST_CLOCKS_CELL(index, offset),        \
		I2S_ESP32_STREAM_INIT(index, rx),                                                  \
		I2S_ESP32_STREAM_INIT(index, tx),                                                  \
	};                                                                                         \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(index, &i2s_esp32_initialize, NULL, &i2s_esp32_data_##index,         \
			      &i2s_esp32_config_##index, POST_KERNEL, CONFIG_I2S_INIT_PRIORITY,    \
			      &i2s_esp32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(I2S_ESP32_INIT)
